%% 输出3----优化前后对比图

x=1:1:14;%x轴上的数据，第一个值代表数据开始，第二个值代表间隔，第三个值代表终止
Tin = [5 28 35 30 10 90 12 30 15 2 40 21 22 16]; %Tin数据y值(表格数据）
Ti=[5 28 35 30 10 87 11 28 13 2 38 21 21 15]; %Ti数据y值（优化数据）
Cin = [25.1354     169.3868     234.0589     186.0535     135.0945     441.3522      45.6628     177.3846      65.3539      17.9605     478.8317     147.1842     396.4281     647.2140]; %Cin数据y值(表格数据）
Ci=[25.14 169.39 234.06 186.05 135.09 441.28 45.97 177.97 65.94 17.96 479.12 147.18 396.58 647.51]; %Ci数据y值（优化数据）
plot(x,Tin,'-*b',x,Ti,'-or',x,Cin,'-xc',x,Ci,'-dm'); %线性，颜色，标记
axis([0,6,0,700])  %确定x轴与y轴框图大小
% set(gca,'XTick',[0:1:15]) %x轴范围1-6，间隔1
% set(gca,'YTick',[0:50:650]) %y轴范围0-700，间隔100
legend('Tin','Ti','Cin','Ci');   %右上角标注
% xlabel(' ')  %x轴坐标描述
% ylabel(' ') %y轴坐标描述

% 
% figure
% x = 1:10;
% y = [5 28 30 25 10 90 32 21 22 16];
% scatter(x,y,50,'r','p','filled');
% hold on;
% y = [5    25    28    25     9    87    31    20    20    15];
% scatter(x,y,30,'k','+');
% set(gca,'xtick',[1:10]);
% set(gca,'xticklabel',['A';'B';'C';'D';'E';'F';'G';'H';'I';'J']);
% legend('Tin','Ti');
% 
% 
% figure
% a = 1:10;
% b = [0.1256 0.5574 0.9389 0.6964 0.3872 0.1915 0.2144 0.4787 0.1715 0.3001];
% scatter(a,b,50,'r','p','filled');
% hold on;
% b = [0.1257    0.5738    0.9485    0.6964    0.3924    1.9145    2.1475    0.4843    1.7254    3.0041];
% scatter(a,b,30,'k','+');
% set(gca,'xtick',[1:10]);
% set(gca,'xticklabel',['A';'B';'C';'D';'E';'F';'G';'H';'I';'J']);
% legend('Cin','Ci');
